def area(a):
    """
    Вычисляет площадь квадрата с заданной целой стороной.

    Параметры:
    a (int): Длина стороны квадрата.

    Возвращает:
    int: Площадь квадрата.

    Пример вызова:
    area(4)  # Возвращает 16
    """
    return a * a

def perimeter(a):
    """
    Вычисляет периметр квадрата с заданной целой стороной.

    Параметры:
    a (int): Длина стороны квадрата.

    Возвращает:
    int: Периметр квадрата.

    Пример вызова:
    perimeter(4)  # Возвращает 16
    """
    return 4 * a
